cases/gate1b/continuum/0/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (100 0 0);
boundaryField
{
    xMax { type cyclic; }
    xMin { type cyclic; }
    yMax { type cyclic; }
    yMin { type cyclic; }
    zMax { type cyclic; }
    zMin { type cyclic; }
}
