cases/gate1b/continuum/0/p
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 42.4135336640006;
boundaryField
{
    xMax { type cyclic; }
    xMin { type cyclic; }
    yMax { type cyclic; }
    yMin { type cyclic; }
    zMax { type cyclic; }
    zMin { type cyclic; }
}
