cases/gate1b/continuum/constant/turbulenceProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType laminar;
