cases/gate1b/continuum/system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-0.0005 -0.0005 -0.0005)
    ( 0.0005 -0.0005 -0.0005)
    ( 0.0005  0.0005 -0.0005)
    (-0.0005  0.0005 -0.0005)
    (-0.0005 -0.0005  0.0005)
    ( 0.0005 -0.0005  0.0005)
    ( 0.0005  0.0005  0.0005)
    (-0.0005  0.0005  0.0005)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (4 4 4) simpleGrading (1 1 1)
);

edges ();

boundary
(
    xMax
    {
        type cyclic;
        neighbourPatch xMin;
        faces ((1 2 6 5));
    }
    xMin
    {
        type cyclic;
        neighbourPatch xMax;
        faces ((0 4 7 3));
    }
    yMax
    {
        type cyclic;
        neighbourPatch yMin;
        faces ((2 3 7 6));
    }
    yMin
    {
        type cyclic;
        neighbourPatch yMax;
        faces ((0 1 5 4));
    }
    zMax
    {
        type cyclic;
        neighbourPatch zMin;
        faces ((4 5 6 7));
    }
    zMin
    {
        type cyclic;
        neighbourPatch zMax;
        faces ((0 3 2 1));
    }
);

mergePatchPairs ();
